HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEth_bf.h
/** \\brief  Mask for Ifx_ETH_ACCEN0_Bits.EN26 */
#define IFX_ETH_ACCEN0_EN26_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_ACCEN0_Bits.EN26 */
#define IFX_ETH_ACCEN0_EN26_OFF (26)

/** \\brief  Length for Ifx_ETH_ACCEN0_Bits.EN27 */
#define IFX_ETH_ACCEN0_EN27_LEN (1)

/** \\brief  Mask for Ifx_ETH_ACCEN0_Bits.EN27 */
#define IFX_ETH_ACCEN0_EN27_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_ACCEN0_Bits.EN27 */
#define IFX_ETH_ACCEN0_EN27_OFF (27)

/** \\brief  Length for Ifx_ETH_ACCEN0_Bits.EN28 */
#define IFX_ETH_ACCEN0_EN28_LEN (1)

/** \\brief  Mask for Ifx_ETH_ACCEN0_Bits.EN28 */
#define IFX_ETH_ACCEN0_EN28_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_ACCEN0_Bits.EN28 */
#define IFX_ETH_ACCEN0_EN28_OFF (28)

/** \\brief  Length for Ifx_ETH_ACCEN0_Bits.EN29 */
#define IFX_ETH_ACCEN0_EN29_LEN (1)

/** \\brief  Mask for Ifx_ETH_ACCEN0_Bits.EN29 */
#define IFX_ETH_ACCEN0_EN29_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_ACCEN0_Bits.EN29 */
#define IFX_ETH_ACCEN0_EN29_OFF (29)

/** \\brief  Length for Ifx_ETH_ACCEN0_Bits.EN2 */
#define IFX_ETH_ACCEN0_EN2_LEN (1)

/** \\brief  Mask for Ifx_ETH_ACCEN0_Bits.EN2 */
#define IFX_ETH_ACCEN0_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_ACCEN0_Bits.EN2 */
#define IFX_ETH_ACCEN0_EN2_OFF (2)

/** \\brief  Length for Ifx_ETH_ACCEN0_Bits.EN30 */
#define IFX_ETH_ACCEN0_EN30_LEN (1)

/** \\brief  Mask for Ifx_ETH_ACCEN0_Bits.EN30 */
#define IFX_ETH_ACCEN0_EN30_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_ACCEN0_Bits.EN30 */
#define IFX_ETH_ACCEN0_EN30_OFF (30)

/** \\brief  Length for Ifx_ETH_ACCEN0_Bits.EN31 */
#define IFX_ETH_ACCEN0_EN31_LEN (1)

/** \\brief  Mask for Ifx_ETH_ACCEN0_Bits.EN31 */
#define IFX_ETH_ACCEN0_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_ACCEN0_Bits.EN31 */
#define IFX_ETH_ACCEN0_EN31_OFF (31)

/** \\brief  Length for Ifx_ETH_ACCEN0_Bits.EN3 */
#define IFX_ETH_ACCEN0_EN3_LEN (1)

/** \\brief  Mask for Ifx_ETH_ACCEN0_Bits.EN3 */
#define IFX_ETH_ACCEN0_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_ACCEN0_Bits.EN3 */
#define IFX_ETH_ACCEN0_EN3_OFF (3)

/** \\brief  Length for Ifx_ETH_ACCEN0_Bits.EN4 */
#define IFX_ETH_ACCEN0_EN4_LEN (1)

/** \\brief  Mask for Ifx_ETH_ACCEN0_Bits.EN4 */
#define IFX_ETH_ACCEN0_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_ACCEN0_Bits.EN4 */
#define IFX_ETH_ACCEN0_EN4_OFF (4)

/** \\brief  Length for Ifx_ETH_ACCEN0_Bits.EN5 */
#define IFX_ETH_ACCEN0_EN5_LEN (1)

/** \\brief  Mask for Ifx_ETH_ACCEN0_Bits.EN5 */
#define IFX_ETH_ACCEN0_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_ACCEN0_Bits.EN5 */
#define IFX_ETH_ACCEN0_EN5_OFF (5)

/** \\brief  Length for Ifx_ETH_ACCEN0_Bits.EN6 */
#define IFX_ETH_ACCEN0_EN6_LEN (1)

/** \\brief  Mask for Ifx_ETH_ACCEN0_Bits.EN6 */
#define IFX_ETH_ACCEN0_EN6_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_ACCEN0_Bits.EN6 */
#define IFX_ETH_ACCEN0_EN6_OFF (6)

/** \\brief  Length for Ifx_ETH_ACCEN0_Bits.EN7 */
#define IFX_ETH_ACCEN0_EN7_LEN (1)

/** \\brief  Mask for Ifx_ETH_ACCEN0_Bits.EN7 */
#define IFX_ETH_ACCEN0_EN7_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_ACCEN0_Bits.EN7 */
#define IFX_ETH_ACCEN0_EN7_OFF (7)

/** \\brief  Length for Ifx_ETH_ACCEN0_Bits.EN8 */
#define IFX_ETH_ACCEN0_EN8_LEN (1)

/** \\brief  Mask for Ifx_ETH_ACCEN0_Bits.EN8 */
#define IFX_ETH_ACCEN0_EN8_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_ACCEN0_Bits.EN8 */
#define IFX_ETH_ACCEN0_EN8_OFF (8)

/** \\brief  Length for Ifx_ETH_ACCEN0_Bits.EN9 */
#define IFX_ETH_ACCEN0_EN9_LEN (1)

/** \\brief  Mask for Ifx_ETH_ACCEN0_Bits.EN9 */
#define IFX_ETH_ACCEN0_EN9_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_ACCEN0_Bits.EN9 */
#define IFX_ETH_ACCEN0_EN9_OFF (9)

/** \\brief  Length for Ifx_ETH_AHB_OR_AXI_STATUS_Bits.AXIRDSTS */
#define IFX_ETH_AHB_OR_AXI_STATUS_AXIRDSTS_LEN (1)

/** \\brief  Mask for Ifx_ETH_AHB_OR_AXI_STATUS_Bits.AXIRDSTS */
#define IFX_ETH_AHB_OR_AXI_STATUS_AXIRDSTS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_AHB_OR_AXI_STATUS_Bits.AXIRDSTS */
#define IFX_ETH_AHB_OR_AXI_STATUS_AXIRDSTS_OFF (1)

/** \\brief  Length for Ifx_ETH_AHB_OR_AXI_STATUS_Bits.AXWHSTS */
#define IFX_ETH_AHB_OR_AXI_STATUS_AXWHSTS_LEN (1)

/** \\brief  Mask for Ifx_ETH_AHB_OR_AXI_STATUS_Bits.AXWHSTS */
#define IFX_ETH_AHB_OR_AXI_STATUS_AXWHSTS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_AHB_OR_AXI_STATUS_Bits.AXWHSTS */
#define IFX_ETH_AHB_OR_AXI_STATUS_AXWHSTS_OFF (0)

/** \\brief  Length for Ifx_ETH_BUS_MODE_Bits.AAL */
#define IFX_ETH_BUS_MODE_AAL_LEN (1)

/** \\brief  Mask for Ifx_ETH_BUS_MODE_Bits.AAL */
#define IFX_ETH_BUS_MODE_AAL_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_BUS_MODE_Bits.AAL */
#define IFX_ETH_BUS_MODE_AAL_OFF (25)

/** \\brief  Length for Ifx_ETH_BUS_MODE_Bits.ATDS */
#define IFX_ETH_BUS_MODE_ATDS_LEN (1)

/** \\brief  Mask for Ifx_ETH_BUS_MODE_Bits.ATDS */
#define IFX_ETH_BUS_MODE_ATDS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_BUS_MODE_Bits.ATDS */
#define IFX_ETH_BUS_MODE_ATDS_OFF (7)

/** \\brief  Length for Ifx_ETH_BUS_MODE_Bits.DA */
#define IFX_ETH_BUS_MODE_DA_LEN (1)

/** \\brief  Mask for Ifx_ETH_BUS_MODE_Bits.DA */
#define IFX_ETH_BUS_MODE_DA_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_BUS_MODE_Bits.DA */
#define IFX_ETH_BUS_MODE_DA_OFF (1)

/** \\brief  Length for Ifx_ETH_BUS_MODE_Bits.DSL */
#define IFX_ETH_BUS_MODE_DSL_LEN (5)

/** \\brief  Mask for Ifx_ETH_BUS_MODE_Bits.DSL */
#define IFX_ETH_BUS_MODE_DSL_MSK (0x1f)

/** \\brief  Offset for Ifx_ETH_BUS_MODE_Bits.DSL */
#define IFX_ETH_BUS_MODE_DSL_OFF (2)

/** \\brief  Length for Ifx_ETH_BUS_MODE_Bits.FB */
#define IFX_ETH_BUS_MODE_FB_LEN (1)

/** \\brief  Mask for Ifx_ETH_BUS_MODE_Bits.FB */
#define IFX_ETH_BUS_MODE_FB_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_BUS_MODE_Bits.FB */
#define IFX_ETH_BUS_MODE_FB_OFF (16)

/** \\brief  Length for Ifx_ETH_BUS_MODE_Bits.MB */
#define IFX_ETH_BUS_MODE_MB_LEN (1)

/** \\brief  Mask for Ifx_ETH_BUS_MODE_Bits.MB */
#define IFX_ETH_BUS_MODE_MB_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_BUS_MODE_Bits.MB */
#define IFX_ETH_BUS_MODE_MB_OFF (26)

/** \\brief  Length for Ifx_ETH_BUS_MODE_Bits.PBL */
#define IFX_ETH_BUS_MODE_PBL_LEN (6)

/** \\brief  Mask for Ifx_ETH_BUS_MODE_Bits.PBL */
#define IFX_ETH_BUS_MODE_PBL_MSK (0x3f)

/** \\brief  Offset for Ifx_ETH_BUS_MODE_Bits.PBL */
#define IFX_ETH_BUS_MODE_PBL_OFF (8)

/** \\brief  Length for Ifx_ETH_BUS_MODE_Bits.PBLx8 */
#define IFX_ETH_BUS_MODE_PBLX8_LEN (1)

/** \\brief  Mask for Ifx_ETH_BUS_MODE_Bits.PBLx8 */
#define IFX_ETH_BUS_MODE_PBLX8_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_BUS_MODE_Bits.PBLx8 */
#define IFX_ETH_BUS_MODE_PBLX8_OFF (24)

/** \\brief  Length for Ifx_ETH_BUS_MODE_Bits.PR */
#define IFX_ETH_BUS_MODE_PR_LEN (2)

/** \\brief  Mask for Ifx_ETH_BUS_MODE_Bits.PR */
#define IFX_ETH_BUS_MODE_PR_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_BUS_MODE_Bits.PR */
#define IFX_ETH_BUS_MODE_PR_OFF (14)

/** \\brief  Length for Ifx_ETH_BUS_MODE_Bits.PRWG */
#define IFX_ETH_BUS_MODE_PRWG_LEN (2)

/** \\brief  Mask for Ifx_ETH_BUS_MODE_Bits.PRWG */
#define IFX_ETH_BUS_MODE_PRWG_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_BUS_MODE_Bits.PRWG */
#define IFX_ETH_BUS_MODE_PRWG_OFF (28)

