HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxEth_bf.h
/** \\brief  Mask for Ifx_ETH_RXTCP_GOOD_OCTETS_Bits.RXTCPGDOCT */
#define IFX_ETH_RXTCP_GOOD_OCTETS_RXTCPGDOCT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXTCP_GOOD_OCTETS_Bits.RXTCPGDOCT */
#define IFX_ETH_RXTCP_GOOD_OCTETS_RXTCPGDOCT_OFF (0)

/** \\brief  Length for Ifx_ETH_RXUDP_ERROR_FRAMES_Bits.RXUDPERRFRM */
#define IFX_ETH_RXUDP_ERROR_FRAMES_RXUDPERRFRM_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXUDP_ERROR_FRAMES_Bits.RXUDPERRFRM */
#define IFX_ETH_RXUDP_ERROR_FRAMES_RXUDPERRFRM_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXUDP_ERROR_FRAMES_Bits.RXUDPERRFRM */
#define IFX_ETH_RXUDP_ERROR_FRAMES_RXUDPERRFRM_OFF (0)

/** \\brief  Length for Ifx_ETH_RXUDP_ERROR_OCTETS_Bits.RXUDPERROCT */
#define IFX_ETH_RXUDP_ERROR_OCTETS_RXUDPERROCT_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXUDP_ERROR_OCTETS_Bits.RXUDPERROCT */
#define IFX_ETH_RXUDP_ERROR_OCTETS_RXUDPERROCT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXUDP_ERROR_OCTETS_Bits.RXUDPERROCT */
#define IFX_ETH_RXUDP_ERROR_OCTETS_RXUDPERROCT_OFF (0)

/** \\brief  Length for Ifx_ETH_RXUDP_GOOD_FRAMES_Bits.RXUDPGDFRM */
#define IFX_ETH_RXUDP_GOOD_FRAMES_RXUDPGDFRM_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXUDP_GOOD_FRAMES_Bits.RXUDPGDFRM */
#define IFX_ETH_RXUDP_GOOD_FRAMES_RXUDPGDFRM_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXUDP_GOOD_FRAMES_Bits.RXUDPGDFRM */
#define IFX_ETH_RXUDP_GOOD_FRAMES_RXUDPGDFRM_OFF (0)

/** \\brief  Length for Ifx_ETH_RXUDP_GOOD_OCTETS_Bits.RXUDPGDOCT */
#define IFX_ETH_RXUDP_GOOD_OCTETS_RXUDPGDOCT_LEN (32)

/** \\brief  Mask for Ifx_ETH_RXUDP_GOOD_OCTETS_Bits.RXUDPGDOCT */
#define IFX_ETH_RXUDP_GOOD_OCTETS_RXUDPGDOCT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_RXUDP_GOOD_OCTETS_Bits.RXUDPGDOCT */
#define IFX_ETH_RXUDP_GOOD_OCTETS_RXUDPGDOCT_OFF (0)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.AIS */
#define IFX_ETH_STATUS_AIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.AIS */
#define IFX_ETH_STATUS_AIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.AIS */
#define IFX_ETH_STATUS_AIS_OFF (15)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.EB */
#define IFX_ETH_STATUS_EB_LEN (3)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.EB */
#define IFX_ETH_STATUS_EB_MSK (0x7)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.EB */
#define IFX_ETH_STATUS_EB_OFF (23)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.ERI */
#define IFX_ETH_STATUS_ERI_LEN (1)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.ERI */
#define IFX_ETH_STATUS_ERI_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.ERI */
#define IFX_ETH_STATUS_ERI_OFF (14)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.ETI */
#define IFX_ETH_STATUS_ETI_LEN (1)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.ETI */
#define IFX_ETH_STATUS_ETI_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.ETI */
#define IFX_ETH_STATUS_ETI_OFF (10)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.FBI */
#define IFX_ETH_STATUS_FBI_LEN (1)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.FBI */
#define IFX_ETH_STATUS_FBI_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.FBI */
#define IFX_ETH_STATUS_FBI_OFF (13)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.GLI */
#define IFX_ETH_STATUS_GLI_LEN (1)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.GLI */
#define IFX_ETH_STATUS_GLI_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.GLI */
#define IFX_ETH_STATUS_GLI_OFF (26)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.GLPII */
#define IFX_ETH_STATUS_GLPII_LEN (1)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.GLPII */
#define IFX_ETH_STATUS_GLPII_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.GLPII */
#define IFX_ETH_STATUS_GLPII_OFF (30)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.GMI */
#define IFX_ETH_STATUS_GMI_LEN (1)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.GMI */
#define IFX_ETH_STATUS_GMI_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.GMI */
#define IFX_ETH_STATUS_GMI_OFF (27)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.GPI */
#define IFX_ETH_STATUS_GPI_LEN (1)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.GPI */
#define IFX_ETH_STATUS_GPI_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.GPI */
#define IFX_ETH_STATUS_GPI_OFF (28)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.NIS */
#define IFX_ETH_STATUS_NIS_LEN (1)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.NIS */
#define IFX_ETH_STATUS_NIS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.NIS */
#define IFX_ETH_STATUS_NIS_OFF (16)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.OVF */
#define IFX_ETH_STATUS_OVF_LEN (1)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.OVF */
#define IFX_ETH_STATUS_OVF_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.OVF */
#define IFX_ETH_STATUS_OVF_OFF (4)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.RI */
#define IFX_ETH_STATUS_RI_LEN (1)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.RI */
#define IFX_ETH_STATUS_RI_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.RI */
#define IFX_ETH_STATUS_RI_OFF (6)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.RPS */
#define IFX_ETH_STATUS_RPS_LEN (1)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.RPS */
#define IFX_ETH_STATUS_RPS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.RPS */
#define IFX_ETH_STATUS_RPS_OFF (8)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.RS */
#define IFX_ETH_STATUS_RS_LEN (3)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.RS */
#define IFX_ETH_STATUS_RS_MSK (0x7)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.RS */
#define IFX_ETH_STATUS_RS_OFF (17)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.RU */
#define IFX_ETH_STATUS_RU_LEN (1)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.RU */
#define IFX_ETH_STATUS_RU_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.RU */
#define IFX_ETH_STATUS_RU_OFF (7)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.RWT */
#define IFX_ETH_STATUS_RWT_LEN (1)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.RWT */
#define IFX_ETH_STATUS_RWT_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_STATUS_Bits.RWT */
#define IFX_ETH_STATUS_RWT_OFF (9)

/** \\brief  Length for Ifx_ETH_STATUS_Bits.TI */
#define IFX_ETH_STATUS_TI_LEN (1)

/** \\brief  Mask for Ifx_ETH_STATUS_Bits.TI */
#define IFX_ETH_STATUS_TI_MSK (0x1)

